In [4]:
import pandas as pd

In [5]:
files = [
    "enrol1.csv",
    "enrol2.csv",
    "enrol3.csv"
]

df = pd.concat(
    [pd.read_csv(f) for f in files],
    ignore_index=True
)

df.to_csv("enrol_merged.csv", index=False)

In [6]:
df.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
0,26-10-2025,Andhra Pradesh,Nalgonda,508004,0,1,0
1,26-10-2025,Andhra Pradesh,Nalgonda,508238,1,0,0
2,26-10-2025,Andhra Pradesh,Nalgonda,508278,1,0,0
3,26-10-2025,Andhra Pradesh,Nandyal,518432,0,1,0
4,26-10-2025,Andhra Pradesh,Nandyal,518543,1,0,0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1006029 entries, 0 to 1006028
Data columns (total 7 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   date            1006029 non-null  object
 1   state           1006029 non-null  object
 2   district        1006029 non-null  object
 3   pincode         1006029 non-null  int64
 4   age_0_5         1006029 non-null  int64
 5   age_5_17        1006029 non-null  int64
 6   age_18_greater  1006029 non-null  int64
dtypes: int64(4), object(3)
memory usage: 53.7+ MB

In [6]:
from ydata_profiling import ProfileReport

profile = ProfileReport(df, explorative=True)
profile.to_file("enrol_report.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

%|                                                     | 0/7 [00:00<?, ?it/s]
100%|█████████████████████████████████████████████| 7/7 [00:00<00:00,  7.64it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [8]:
df[df.duplicated(keep=False)].sort_values(
    ["date", "state", "district", "pincode"]
)

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
88088,02-11-2025,Assam,Dibrugarh,786007,2,0,0
90380,02-11-2025,Assam,Dibrugarh,786007,2,0,0
88089,02-11-2025,Assam,Dibrugarh,786008,3,0,0
90381,02-11-2025,Assam,Dibrugarh,786008,3,0,0
88090,02-11-2025,Assam,Dibrugarh,786012,1,0,0
...,...,...,...,...,...,...,...
501613,31-12-2025,Telangana,Hyderabad,500061,4,2,0
499998,31-12-2025,Telangana,Hyderabad,500062,1,4,0
501614,31-12-2025,Telangana,Hyderabad,500062,1,4,0
499999,31-12-2025,Telangana,Hyderabad,500095,0,1,0
501615,31-12-2025,Telangana,Hyderabad,500095,0,1,0

In [9]:
rows_before = df.shape[0]
print(rows_before)

1006029

In [10]:
df_clean= df.drop_duplicates(
    subset=['date', 'pincode', 'age_0_5', 'age_5_17','age_18_greater'],
    keep='first'
)

In [11]:
rows_after = df_clean.shape[0]

In [12]:
rows_removed = rows_before - rows_after
percent_removed = (rows_removed / rows_before) * 100

print("Rows before :", rows_before)
print("Rows after  :", rows_after)
print("Rows removed:", rows_removed)
print(f"Decrease %  : {percent_removed:.2f}%")

Rows before : 1006029
Rows after  : 963224
Rows removed: 42805
Decrease %  : 4.25%

In [13]:
df_clean[(df_clean["pincode"] == 786007) & (df_clean["date"] == "02-11-2025")]

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater
88088,02-11-2025,Assam,Dibrugarh,786007,2,0,0

In [14]:
df_clean = df_clean.reset_index(drop=True)

In [15]:
print("Duplicate rows:", df_clean.duplicated().sum())

Duplicate rows: 0

In [16]:
print("unique Raw states:", df_clean['state'].nunique())

unique Raw states: 55

In [17]:
print(df_clean["state"].unique())

['Andhra Pradesh' 'Arunachal Pradesh' 'Assam' 'West Bengal' 'Chhattisgarh'
 'Delhi' 'Goa' 'Gujarat' 'Haryana' 'Himachal Pradesh' 'Jammu and Kashmir'
 'Jharkhand' 'Karnataka' 'Kerala' 'Ladakh' 'Lakshadweep' 'Madhya Pradesh'
 'Maharashtra' 'Manipur' 'Meghalaya' 'Mizoram' 'Nagaland' 'Odisha'
 'Orissa' 'Pondicherry' 'Puducherry' 'Punjab' 'Rajasthan' 'Tamil Nadu'
 'Telangana' 'Tripura' 'Uttar Pradesh' 'Uttarakhand'
 'Andaman & Nicobar Islands' 'Andaman and Nicobar Islands' 'Bihar'
 'Chandigarh' 'Sikkim' 'West Bangal' 'Dadra and Nagar Haveli'
 'Daman and Diu' 'Dadra and Nagar Haveli and Daman and Diu'
 'Jammu & Kashmir' 'andhra pradesh' 'Dadra & Nagar Haveli' 'Westbengal'
 'Daman & Diu' 'WESTBENGAL' 'West bengal' 'West  Bengal' 'WEST BENGAL'
 '100000' 'The Dadra And Nagar Haveli And Daman And Diu'
 'Jammu And Kashmir' 'ODISHA']

In [18]:
df_clean["state_clean"] = df_clean["state"].str.lower().str.strip()
print(sorted(df_clean["state_clean"].unique()))

['100000', 'andaman & nicobar islands', 'andaman and nicobar islands', 'andhra pradesh', 'arunachal pradesh', 'assam', 'bihar', 'chandigarh', 'chhattisgarh', 'dadra & nagar haveli', 'dadra and nagar haveli', 'dadra and nagar haveli and daman and diu', 'daman & diu', 'daman and diu', 'delhi', 'goa', 'gujarat', 'haryana', 'himachal pradesh', 'jammu & kashmir', 'jammu and kashmir', 'jharkhand', 'karnataka', 'kerala', 'ladakh', 'lakshadweep', 'madhya pradesh', 'maharashtra', 'manipur', 'meghalaya', 'mizoram', 'nagaland', 'odisha', 'orissa', 'pondicherry', 'puducherry', 'punjab', 'rajasthan', 'sikkim', 'tamil nadu', 'telangana', 'the dadra and nagar haveli and daman and diu', 'tripura', 'uttar pradesh', 'uttarakhand', 'west  bengal', 'west bangal', 'west bengal', 'westbengal']

In [19]:
fix_map = {
    "orissa": "odisha",
    "pondicherry": "puducherry",
    'chhatisgarh': 'chhattisgarh',
    'balanagar': 'telangana',
    'puttenahalli':'karnataka',
    'raja annamalai puram':'tamil nadu',
    'darbhanga': 'bihar',
    'madanapalle':'andhra pradesh',
    'nagpur':'madhya pradesh',
    
    'west bengli': "west bengal",
    "west bangal": "west bengal",
    "westbengal": "west bengal",
    "west  bengal": "west bengal",
    'uttaranchal':'uttarakhand',
    'jaipur':'rajasthan',

    "jammu & kashmir": "jammu and kashmir",
    'tamilnadu':'tamil nadu',

    "andaman & nicobar islands": "andaman and nicobar islands",
    'the dadra and nagar haveli and daman and diu':"dadra and nagar haveli and daman and diu",
    "dadra & nagar haveli": "dadra and nagar haveli and daman and diu",
    "daman and diu": "dadra and nagar haveli and daman and diu",
    "daman & diu": "dadra and nagar haveli and daman and diu",
    "dadra and nagar haveli": "dadra and nagar haveli and daman and diu",
    "100000": None
}
df_clean["state_clean"] = df_clean["state_clean"].replace(fix_map)
df_clean = df_clean[df_clean["state_clean"].notna()]
print("\nSTEP-2.4 Final Clean Result:")
print("Final Clean States & UTs:", df_clean["state_clean"].nunique())
print(sorted(df_clean["state_clean"].unique()))

STEP-2.4 Final Clean Result:
Final Clean States & UTs: 36
['andaman and nicobar islands', 'andhra pradesh', 'arunachal pradesh', 'assam', 'bihar', 'chandigarh', 'chhattisgarh', 'dadra and nagar haveli and daman and diu', 'delhi', 'goa', 'gujarat', 'haryana', 'himachal pradesh', 'jammu and kashmir', 'jharkhand', 'karnataka', 'kerala', 'ladakh', 'lakshadweep', 'madhya pradesh', 'maharashtra', 'manipur', 'meghalaya', 'mizoram', 'nagaland', 'odisha', 'puducherry', 'punjab', 'rajasthan', 'sikkim', 'tamil nadu', 'telangana', 'tripura', 'uttar pradesh', 'uttarakhand', 'west bengal']

In [20]:
df_clean.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,state_clean
0,26-10-2025,Andhra Pradesh,Nalgonda,508004,0,1,0,andhra pradesh
1,26-10-2025,Andhra Pradesh,Nalgonda,508238,1,0,0,andhra pradesh
2,26-10-2025,Andhra Pradesh,Nalgonda,508278,1,0,0,andhra pradesh
3,26-10-2025,Andhra Pradesh,Nandyal,518432,0,1,0,andhra pradesh
4,26-10-2025,Andhra Pradesh,Nandyal,518543,1,0,0,andhra pradesh

In [21]:
df_clean['state_clean'] = df_clean['state_clean'].astype(str).str.strip().str.title()
df_clean.head()

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,state_clean
0,26-10-2025,Andhra Pradesh,Nalgonda,508004,0,1,0,Andhra Pradesh
1,26-10-2025,Andhra Pradesh,Nalgonda,508238,1,0,0,Andhra Pradesh
2,26-10-2025,Andhra Pradesh,Nalgonda,508278,1,0,0,Andhra Pradesh
3,26-10-2025,Andhra Pradesh,Nandyal,518432,0,1,0,Andhra Pradesh
4,26-10-2025,Andhra Pradesh,Nandyal,518543,1,0,0,Andhra Pradesh

In [22]:
df_clean.drop(columns=['state'])

,date,district,pincode,age_0_5,age_5_17,age_18_greater,state_clean
0,26-10-2025,Nalgonda,508004,0,1,0,Andhra Pradesh
1,26-10-2025,Nalgonda,508238,1,0,0,Andhra Pradesh
2,26-10-2025,Nalgonda,508278,1,0,0,Andhra Pradesh
3,26-10-2025,Nandyal,518432,0,1,0,Andhra Pradesh
4,26-10-2025,Nandyal,518543,1,0,0,Andhra Pradesh
...,...,...,...,...,...,...,...
963219,26-10-2025,Mahbubnagar,509206,0,1,0,Andhra Pradesh
963220,26-10-2025,Mahbubnagar,509207,1,0,0,Andhra Pradesh
963221,26-10-2025,Medak,502220,1,0,0,Andhra Pradesh
963222,26-10-2025,Medak,502286,1,0,0,Andhra Pradesh
963223,26-10-2025,N. T. R,521402,1,0,0,Andhra Pradesh

In [23]:
dup_pincode_rows = df_clean[
    df_clean.duplicated(subset=['pincode', 'date'], keep=False)
].sort_values(['pincode', 'date'])

dup_pincode_rows

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,state_clean
482750,01-09-2025,Delhi,New Delhi,110001,2,0,0,Delhi
485924,01-09-2025,Delhi,Central Delhi,110001,0,1,0,Delhi
89550,02-11-2025,Delhi,Central Delhi,110001,0,0,1,Delhi
89557,02-11-2025,Delhi,New Delhi,110001,4,0,0,Delhi
105608,05-11-2025,Delhi,New Delhi,110001,2,1,0,Delhi
...,...,...,...,...,...,...,...,...
458379,29-12-2025,Bihar,Kishanganj,855115,21,2,0,Bihar
46039,30-10-2025,Bihar,Kishanganj,855115,13,3,0,Bihar
46104,30-10-2025,Bihar,Purnia,855115,1,1,0,Bihar
463029,31-12-2025,Bihar,Purnia,855115,5,7,0,Bihar
475862,31-12-2025,Bihar,Kishanganj,855115,29,5,0,Bihar

In [24]:
df_clean[(df_clean["pincode"] == 855115) & (df_clean["date"] == "30-10-2025")]

,date,state,district,pincode,age_0_5,age_5_17,age_18_greater,state_clean
46039,30-10-2025,Bihar,Kishanganj,855115,13,3,0,Bihar
46104,30-10-2025,Bihar,Purnia,855115,1,1,0,Bihar

In [25]:
df_agg = (
    df_clean
    .groupby(['date', 'pincode'], as_index=False)
    .agg({
        'state_clean': lambda x: x.mode().iloc[0],
        'district': lambda x: x.mode().iloc[0],
        'age_0_5': 'sum',
        'age_5_17': 'sum',
        'age_18_greater':'sum'
    })
)

In [26]:
df_agg[(df_agg["pincode"] == 855115) & (df_agg["date"] == "30-10-2025")]

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater
841182,30-10-2025,855115,Bihar,Kishanganj,14,4,0

In [27]:
dup_pincode_rows = df_agg[
    df_agg.duplicated(subset=['pincode', 'date'], keep=False)
].sort_values(['pincode', 'date'])

dup_pincode_rows

Empty DataFrame
Columns: [date, pincode, state_clean, district, age_0_5, age_5_17, age_18_greater]
Index: []

In [28]:
df_agg['date'] = pd.to_datetime(
    df_agg['date'],
    format='%d-%m-%Y'
)

In [29]:
df_agg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 868855 entries, 0 to 868854
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            868855 non-null  datetime64[ns]
 1   pincode         868855 non-null  int64
 2   state_clean     868855 non-null  object
 3   district        868855 non-null  object
 4   age_0_5         868855 non-null  int64
 5   age_5_17        868855 non-null  int64
 6   age_18_greater  868855 non-null  int64
dtypes: datetime64[ns](1), int64(4), object(2)
memory usage: 46.4+ MB

In [30]:
df_agg['date_month']= df_agg['date'].dt.month_name()
df_agg.sample(5)

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month
36843,2025-09-02,787034,Assam,Dhemaji,2,0,0,September
115641,2025-09-06,425201,Maharashtra,Jalgaon,1,2,0,September
793252,2025-12-28,508243,Telangana,Nalgonda,1,0,0,December
161801,2025-09-08,700059,West Bengal,North 24 Parganas,1,1,0,September
71321,2025-11-03,502295,Telangana,Sangareddy,1,0,0,November

In [31]:
df_agg['date_day_name']= df_agg['date'].dt.day_name()
df_agg.head(5)

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month,date_day_name
0,2025-04-01,110003,Delhi,Central Delhi,80,41,12,April,Tuesday
1,2025-04-01,110017,Delhi,South Delhi,151,35,12,April,Tuesday
2,2025-04-01,110018,Delhi,West Delhi,275,96,32,April,Tuesday
3,2025-04-01,110032,Delhi,Shahdara,208,98,13,April,Tuesday
4,2025-04-01,110034,Delhi,North West Delhi,295,101,13,April,Tuesday

In [32]:
df_agg['quater']= df_agg['date'].dt.quarter
df_agg.sample(5)

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month,date_day_name,quater
150366,2025-11-07,828305,Jharkhand,Dhanbad,1,0,0,November,Friday,4
530599,2025-11-19,246130,Uttarakhand,Pauri Garhwal,1,0,0,November,Wednesday,4
771855,2025-12-27,621701,Tamil Nadu,Ariyalur,1,0,0,December,Saturday,4
54047,2025-09-03,207123,Uttar Pradesh,Kasganj,8,1,0,September,Wednesday,3
792914,2025-12-28,497226,Chhattisgarh,Surajpur,2,1,0,December,Sunday,4

In [33]:
df_agg[(df_agg["pincode"] == 855115) & (df_agg["date"] == "30-10-2025")]

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month,date_day_name,quater
841182,2025-10-30,855115,Bihar,Kishanganj,14,4,0,October,Thursday,4

In [34]:
df_agg.to_csv("enrolment.csv", index=False)

In [50]:
from ydata_profiling import ProfileReport

profile = ProfileReport(df_agg, explorative=True)
profile.to_file("enrol.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

%|                                                    | 0/10 [00:00<?, ?it/s]
100%|███████████████████████████████████████████| 10/10 [00:00<00:00, 15.66it/s]
/opt/anaconda3/lib/python3.13/site-packages/ydata_profiling/model/pandas/discretize_pandas.py:52: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[3 3 3 ... 9 9 9]' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  discretized_df.loc[:, column] = self._discretize_column(

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [46]:
df_agg.to_csv("enrolment.csv", index=False)

In [47]:
df_new = pd.read_csv("enrolment.csv")

In [48]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 868855 entries, 0 to 868854
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   date            868855 non-null  object
 1   pincode         868855 non-null  int64
 2   state_clean     868855 non-null  object
 3   district        868855 non-null  object
 4   age_0_5         868855 non-null  int64
 5   age_5_17        868855 non-null  int64
 6   age_18_greater  868855 non-null  int64
 7   date_month      868855 non-null  object
 8   date_day_name   868855 non-null  object
 9   quater          868855 non-null  int64
dtypes: int64(5), object(5)
memory usage: 66.3+ MB

In [49]:
df_new.head()

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month,date_day_name,quater
0,2025-04-01,110003,Delhi,Central Delhi,80,41,12,April,Tuesday,2
1,2025-04-01,110017,Delhi,South Delhi,151,35,12,April,Tuesday,2
2,2025-04-01,110018,Delhi,West Delhi,275,96,32,April,Tuesday,2
3,2025-04-01,110032,Delhi,Shahdara,208,98,13,April,Tuesday,2
4,2025-04-01,110034,Delhi,North West Delhi,295,101,13,April,Tuesday,2

In [50]:
df_new[(df_new["pincode"] == 855115) & (df_new["date"] == "2025-10-30")]

,date,pincode,state_clean,district,age_0_5,age_5_17,age_18_greater,date_month,date_day_name,quater
841182,2025-10-30,855115,Bihar,Kishanganj,14,4,0,October,Thursday,4

In [51]:
print("\nSTEP-2.4 Final Clean Result:")
print("Final Clean States & UTs:", df_new["state_clean"].nunique())
print(sorted(df_clean["state_clean"].unique()))

STEP-2.4 Final Clean Result:
Final Clean States & UTs: 36
['Andaman And Nicobar Islands', 'Andhra Pradesh', 'Arunachal Pradesh', 'Assam', 'Bihar', 'Chandigarh', 'Chhattisgarh', 'Dadra And Nagar Haveli And Daman And Diu', 'Delhi', 'Goa', 'Gujarat', 'Haryana', 'Himachal Pradesh', 'Jammu And Kashmir', 'Jharkhand', 'Karnataka', 'Kerala', 'Ladakh', 'Lakshadweep', 'Madhya Pradesh', 'Maharashtra', 'Manipur', 'Meghalaya', 'Mizoram', 'Nagaland', 'Odisha', 'Puducherry', 'Punjab', 'Rajasthan', 'Sikkim', 'Tamil Nadu', 'Telangana', 'Tripura', 'Uttar Pradesh', 'Uttarakhand', 'West Bengal']

In [52]:
state_data = df_new[df_new["state_clean"] =='Jammu And Kashmir']

In [53]:
print(state_data)

              date  pincode        state_clean  district  age_0_5  age_5_17  \
36      2025-04-01   185121  Jammu And Kashmir     Punch      142        59
866     2025-05-01   181221  Jammu And Kashmir     Jammu       55        16
867     2025-05-01   193201  Jammu And Kashmir  Baramula      136        39
2020    2025-07-01   182203  Jammu And Kashmir      Doda      261       260
2021    2025-07-01   192303  Jammu And Kashmir   Shopian      308        84
...            ...      ...                ...       ...      ...       ...
855378  2025-12-31   194105  Jammu And Kashmir    Kargil        0         3
855379  2025-12-31   194106  Jammu And Kashmir       Leh        1         1
855380  2025-12-31   194109  Jammu And Kashmir    Kargil        1         0
855381  2025-12-31   194301  Jammu And Kashmir    Kargil        3         3
855382  2025-12-31   194401  Jammu And Kashmir       Leh        0         1

        age_18_greater date_month date_day_name  quater
36                  10      April       Tuesday       2
866                 10        May      Thursday       2
867                 12        May      Thursday       2
2020                17       July       Tuesday       3
2021                20       July       Tuesday       3
...                ...        ...           ...     ...
855378               0   December     Wednesday       4
855379               0   December     Wednesday       4
855380               0   December     Wednesday       4
855381               0   December     Wednesday       4
855382               0   December     Wednesday       4

[9853 rows x 10 columns]

In [57]:
fix_map = {"Jammu And Kashmir": 'Jammu and Kashmir' 
}
df_new["state_clean"] = df_new["state_clean"].replace(fix_map)
df_new = df_new[df_new["state_clean"].notna()]
print("\nSTEP-2.4 Final Clean Result:")
print("Final Clean States & UTs:", df_new["state_clean"].nunique())
print(sorted(df_new["state_clean"].unique()))

STEP-2.4 Final Clean Result:
Final Clean States & UTs: 36
['Andaman And Nicobar Islands', 'Andhra Pradesh', 'Arunachal Pradesh', 'Assam', 'Bihar', 'Chandigarh', 'Chhattisgarh', 'Dadra And Nagar Haveli And Daman And Diu', 'Delhi', 'Goa', 'Gujarat', 'Haryana', 'Himachal Pradesh', 'Jammu and Kashmir', 'Jharkhand', 'Karnataka', 'Kerala', 'Ladakh', 'Lakshadweep', 'Madhya Pradesh', 'Maharashtra', 'Manipur', 'Meghalaya', 'Mizoram', 'Nagaland', 'Odisha', 'Puducherry', 'Punjab', 'Rajasthan', 'Sikkim', 'Tamil Nadu', 'Telangana', 'Tripura', 'Uttar Pradesh', 'Uttarakhand', 'West Bengal']

In [58]:
df_new.to_csv("enrolment.csv", index=False)